app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "birthday", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Super"], ["last_name", "August"], ["birthday", "1989-12-02"], ["created_at", "2015-08-19 10:49:28.633767"], ["updated_at", "2015-08-19 10:49:28.633767"]]
---
  def create
    if student.save

UPDATE "students" SET "first_name" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["first_name", "Walter"], ["updated_at", "2015-08-17 15:01:28.173353"], ["id", 6]]
---
  def update
    if student.save

DELETE FROM "students" WHERE "students"."id" = $1  [["id", 1]]
---
  def destroy
    student.destroy