app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("first_name", "last_name", "academic_title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Darrin"], ["last_name", "Steuber"], ["academic_title", "Prof."], ["created_at", "2015-08-17 15:02:21.651156"], ["updated_at", "2015-08-17 15:02:21.651156"]]
---
  def create
    if teacher.save

UPDATE "teachers" SET "first_name" = $1, "updated_at" = $2 WHERE "teachers"."id" = $3  [["first_name", "Walter"], ["updated_at", "2015-08-17 15:02:21.729252"], ["id", 6]]
---
  def update
    if teacher.save

DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 10]]
---
  def destroy
    teacher.destroy